Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
                    // Flush out and ignore the command
                    scl_get_command(&scl_1);

                } else {

                    // -------------------
                    //  Not running
                    // -------------------

                    str_cmd = scl_get_command(&scl_1);

                    if (strcmp(str_cmd, "id?") == 0) {
                        // Report identity string
                        io_print("Arduino lock-in amp\n");

                    } else if (strcmp(str_cmd, "mcu?") == 0) {
                        // Report microcontroller model, serial and firmware
                        char str_model[12];
                        char str_uid[9];

                        snprintf(str_model, sizeof(str_model),
                                 #if defined(__SAMD21G18A__)
                                 "SAMD21G18A"
                                 #elif defined(__SAMD21E18A__)
                                 "SAMD21E18A"
                                 #elif defined(__SAMD51P20A__)
                                 "SAMD51P20A"
                                 #elif defined(__SAMD51J19A__)
                                 "SAMD51J19A"
                                 #elif defined(__SAMD51G19A__)
                                 "SAMD51G19A"
                                 #else
                                 "unknown MCU"
                                 #endif
                                 );
                        format_byte_array_as_hex8string(str_uid,
                                                        sizeof(str_uid),
                                                        mcu_uid);
                        snprintf(str_buffer, MAXLEN_STR_BUFFER, "%s\t%s\t%s\n",
                                 FIRMWARE_VERSION, str_model, str_uid);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "const?") == 0) {
                        // Report constants
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%.6f\t%u\t%u\t%u\t%u\t%.3f\t%u\t%u\n",
                                 SAMPLING_PERIOD_us,
                                 BLOCK_SIZE,
                                 N_BYTES_TX_BUFFER,
                                 DAC_OUTPUT_BITS,
                                 ADC_INPUT_BITS,
                                 A_REF,
                                 MIN_N_LUT,
                                 MAX_N_LUT);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "ref?") == 0 ||
                               strcmp(str_cmd, "?") == 0) {
                        // Report reference signal settings
                        io_print_ref();
                        
                    } else if (strcmp(str_cmd, "lut?") == 0) {
                        // Report N_LUT and the waveform type as ASCII
                        // And report the full LUT as a binary stream
                        io_print_LUT();

                    } else if (strcmp(str_cmd, "lut_ascii?") == 0) {
                        // Report N_LUT and the waveform type as ASCII
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%u\t%s\n",
                                 N_LUT,
                                 WAVEFORM_STRING[ref_waveform]);
                        io_print(str_buffer);
                        
                        // Report the full LUT as ASCII, tab delimited
                        // Slow but handy for debugging
                        for (uint16_t i = 0; i < N_LUT - 1; i++) {
                            sprintf(str_buffer, "%u\t", LUT_wave[i]);
                            io_print(str_buffer);
                        }
                        sprintf(str_buffer, "%u\n", LUT_wave[N_LUT - 1]);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "time?") == 0) {
                        // Report time in microseconds
                        io_print_timestamp();

                    } else if (strcmp(str_cmd, "off") == 0) {
                        // Lock-in amp is already off and we reply with an
                        // acknowledgment
                        io_print("already_off\n");

                    } else if (strcmp(str_cmd, "on") == 0) {
                        // Start lock-in amp
                        start_LIA();

                    } else if (strncmp(str_cmd, "freq", 4) == 0) {
                        // Set frequency of reference signal [Hz]
                        // And report the obtained reference signal settings
                        compute_LUT(LUT_wave, atof(&str_cmd[4]));
                        io_print_ref();

                    } else if (strncmp(str_cmd, "offs", 4) == 0) {
                        // Set offset of reference signal [V]
                        // And report the obtained reference signal settings
                        ref_V_offset = atof(&str_cmd[4]);
                        ref_V_offset = max(ref_V_offset, 0.0);
                        ref_V_offset = min(ref_V_offset, A_REF);
                        compute_LUT(LUT_wave, ref_freq);
                        io_print_ref();

                    } else if (strncmp(str_cmd, "ampl", 4) == 0) {
                        // Set amplitude of reference signal [V]
                        // And report the obtained reference signal settings
                        ref_V_ampl = atof(&str_cmd[4]);
                        ref_V_ampl = max(ref_V_ampl, 0.0);
                        ref_V_ampl = min(ref_V_ampl, A_REF);
                        compute_LUT(LUT_wave, ref_freq);
                        io_print_ref();

                    } else if (strcmp(str_cmd, "cos") == 0) {
                        ref_waveform = Cosine;
                        compute_LUT(LUT_wave, ref_freq);
                        //io_print_LUT();

                    } else if (strcmp(str_cmd, "sqr") == 0) {
                        ref_waveform = Square;
                        compute_LUT(LUT_wave, ref_freq);
                        //io_print_LUT();

                    } else if (strcmp(str_cmd, "saw") == 0) {
                        ref_waveform = Sawtooth;
                        compute_LUT(LUT_wave, ref_freq);
                        //io_print_LUT();

                    } else if (strcmp(str_cmd, "tri") == 0) {
                        ref_waveform = Triangle;
                        compute_LUT(LUT_wave, ref_freq);
                        //io_print_LUT();

                    } else if (strcmp(str_cmd, "ecg") == 0) {
                        ref_waveform = ECG;
                        compute_LUT(LUT_wave, ref_freq);
                        //io_print_LUT();
                    }
                }
            }
        }
    }
}
